---
kind: property
id: P:Autodesk.Revit.DB.Edge.Reference
source: html/7ed9676a-c2bf-7580-41e0-5b1a29e27fb2.htm
---
# Autodesk.Revit.DB.Edge.Reference Property

Returns a stable reference to the edge.

## Syntax (C#)
```csharp
public Reference Reference { get; }
```

## Remarks
This value is if the corresponding geometry object does not permit referencing.